Re3600/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0); //initial conditions

boundaryField
{
    inlet
    { 
        type            fixedValue;
        value           uniform (0.054 0 0); //0,054 do 0,0003
    }
    outlet
    {
        type        zeroGradient;
    }
    wall
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }
    obstacle
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }
    frontAndBack
    {
        type        empty;
    }
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
